linux_sys_analysis/ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《Linux系统分析》教材及参考资料</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《Linux系统分析》教材及参考资料"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-26T22:18+0800"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《Linux系统分析》教材及参考资料</h1>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">教材</a></li>
<li><a href="#sec-2">参考资料</a>
<ul>
<li><a href="#sec-2-1">书籍</a>
<ul>
<li><a href="#sec-2-1-1">Linux Kernel</a></li>
<li><a href="#sec-2-1-2">操作系统基础</a></li>
<li><a href="#sec-2-1-3">实验指导</a></li>
<li><a href="#sec-2-1-4">其它</a></li>
</ul>
</li>
<li><a href="#sec-2-2">开放课程</a></li>
<li><a href="#sec-2-3">Wikipedia</a>
<ul>
<li><a href="#sec-2-3-1">Operating System Structures</a></li>
<li><a href="#sec-2-3-2">Process Management</a></li>
<li><a href="#sec-2-3-3">Memory Management</a></li>
<li><a href="#sec-2-3-4">File Management</a></li>
<li><a href="#sec-2-3-5">I/O Systems</a></li>
</ul>
</li>
<li><a href="#sec-2-4">More Web Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">教材</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>D.P. Bovet and M. Cesatí. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/kernel/OREILLY-Understanding_The_Linux_Kernel_3e/"><i>Understanding The Linux Kernel. O'Reilly</i></a>, 3<sup>rd</sup>
    edition, 2005. (《理解Linux内核》第三版)
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">参考资料</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">书籍</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">Linux Kernel</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>R. Love. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/Linux/kernel/Addison-Wesley-Linux_kernel_development-3e.pdf"><i>Linux Kernel Development</i></a>. Developer's Library. Addison-Wesley, 2010.
</li>
<li>W. Mauerer. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/kernel/Professional_Linux_Kernel_Architecture.pdf"><i>Professional Linux Kernel Architecture</i></a>. John Wiley &amp; Sons, 2008.
</li>
<li>C.S. Rodriguez, G. Fischer, and S. Smolski. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/Linux/kernel/The-Linux-Kernel-Primer">The Linux kernel primer: a top-down approach for x86 and PowerPC architectures</a>. Prentice Hall Professional Technical
      Reference, 2005.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">操作系统基础</h4>
<div class="outline-text-4" id="text-2-1-2">

<ol>
<li>Silberschatz, Galvin, and Gagne. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/os-concepts-8e/Operating_System_Concepts_Essential-8e.pdf"><i>Operating System Concepts Essentials</i></a>. John Wiley &amp;
       Sons, 2011.
<ul>
<li>图书馆<a href="http://202.203.132.134:8080/opac/openlink.php?strText=操作系统概念&amp;doctype=ALL&amp;strSearchType=title&amp;match_flag=forward&amp;displaypg=20&amp;sort=CATA_DATE&amp;orderby=desc&amp;showmode=list&amp;location=ALL">中英文版</a>都有;
</li>
<li><a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/os-concepts-8e/Operating_System_Concepts-7e-Instructors_Manual.pdf">Instructor's Manual To Accompany Operating System Concepts, 7e</a>；
</li>
<li><a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/os-concepts-8e/">配套英文讲义、幻灯片</a>；
</li>
<li>这本也可以: Silberschatz, Galvin, and Gagne. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/os-concepts-8e/Operating_System_Concepts_With_Java-8e.pdf"><i>Operating System Concepts With Java</i></a>. John Wiley &amp; Sons, 8<sup>th</sup> edition, 2010.
</li>
</ul>

</li>
<li>A.S. Tanenbaum. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/moss/Modern_Operating_Systems-3e.pdf"><i>Modern Operating Systems</i></a>. Pearson Prentice Hall, 3<sup>rd</sup> edition, 2008.
<ul>
<li>图书馆<a href="http://202.203.132.134:8080/opac/openlink.php?strText=现代操作系统&amp;doctype=ALL&amp;strSearchType=title&amp;match_flag=forward&amp;displaypg=20&amp;sort=CATA_DATE&amp;orderby=desc&amp;showmode=list&amp;location=ALL">中英文版</a>都有；
</li>
<li><a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/moss/">配套英文讲义、幻灯片</a>;
</li>
</ul>

</li>
<li>Bryant, Randal E. and O'Hallaron, David R. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/programming/Computer_Systems-A_Programmers_Perspective-2e.pdf"><i>Computer Systems: A Programmer's Perspective</i></a>. Addison-Wesley, 2<sup>nd</sup> edition, 2010.
</li>
<li>M.J. Bach. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/The_Design_of_the_UNIX_Operating_System-Bach.djvu"><i>The design of the UNIX operating system</i></a>. Prentice-Hall software
       series. Prentice-Hall, 1986.
</li>
<li>邹恒明. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/zouhengming09.pdf"><i>计算机的心智：操作系统之哲学原理</i></a>. 机械工业出版社, 2009.
</li>
</ol>


</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">实验指导</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>Kernel Projects For Linux (《Linux操作系统内核实习》)
<ul>
<li>图书馆有<a href="http://202.203.132.134:8080/opac/openlink.php?strText=Linux操作系统内核实习&amp;doctype=ALL&amp;strSearchType=title&amp;match_flag=forward&amp;displaypg=20&amp;sort=CATA_DATE&amp;orderby=desc&amp;showmode=list&amp;location=ALL">英文版</a>, 但没有中文版;
</li>
<li>cs2上有该书第一部分(Overview of Linux)的<a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/KPFL_Part1-1e.pdf">英文电子版</a>;
</li>
</ul>

</li>
<li>Greg Kroah-Hartman. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/Linux/kernel/Linux-Kernel-in-a-Nutshell.pdf"><i>Linux Kernel in a Nutshell</i></a>. O'Reilly, 2007.
</li>
<li>于渊. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/OrangeS/"><i>Orange'S：一个操作系统的实现</i></a>. 电子工业出版社, 2009.
<ul>
<li>本书最大的好处是能帮你挣脱理论书的催眠效果. 它是<a href="http://www.osfromscratch.org">《自己动手写操作系统》的第二版</a>, 写得相当不错, 文字活泼, 顺畅, 内容易懂, 操作细节描述清晰, 实践性强, 边看边练, 不会犯困. 个人感觉唯一的缺憾是对理论概念的解释不够详尽, 但毕竟这是一个实验教程, 理论概念不是本书的重点. 遇到理论问题,可以直接查阅上面列出的三本理论教材.
</li>
</ul>

</li>
<li>《使用开源软件-自己动手写操作系统》 <a href="http://share.solrex.org/WriteOS/index_chs.html">免费电子版</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4">其它</h4>
<div class="outline-text-4" id="text-2-1-4">

<ul>
<li><a href="http://202.203.132.134:8080/opac/openlink.php?strText=操作系统&amp;doctype=ALL&amp;strSearchType=title&amp;match_flag=forward&amp;displaypg=20&amp;sort=CATA_DATE&amp;orderby=desc&amp;showmode=list&amp;location=ALL">图书馆藏书</a>
</li>
<li><a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/">http://cs2.swfu.edu.cn/pub/resources/Books/OS/</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">开放课程</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li><a href="http://www.cs.usfca.edu/~cruse/cs635f07/">USFCA - CS 635: Advanced Systems Programming (Fall 2007)</a>
</li>
<li><a href="http://pdos.csail.mit.edu/6.828">MIT - 6.828: Operating System Engineering</a>
</li>
<li><a href="http://staff.ustc.edu.cn/~xlanchen/2011FallULK/ULK2011Fall.html">中科大 - Linux操作系统分析</a>
</li>
<li><a href="http://www.ss.pku.edu.cn/linux/index.php?option=com_content&amp;task=section&amp;id=1&amp;Itemid=2">北大 - Linux操作系统分析与实践</a>
</li>
<li><a href="http://bm.gduf.edu.cn/kcpt/Linuxczxtfx/Linux%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F1.htm">GDUF - Linux操作系统分析</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Wikipedia</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">Operating System Structures</h4>
<div class="outline-text-4" id="text-2-3-1">

<ul>
<li><a href="http://en.wikipedia.org/wiki/Von_Neumann_architecture">Von Neumann architecture</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/BIOS">BIOS</a>, <a href="http://en.wikipedia.org/wiki/Extensible_Firmware_Interface">EFI</a>, <a href="http://en.wikipedia.org/wiki/Coreboot">Coreboot(LinuxBIOS)</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Firmware">Firmware</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Master_boot_record">MBR</a> and <a href="http://en.wikipedia.org/wiki/GUID_Partition_Table">GPT</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Bootstrap_loader">Bootstrapping</a>, <a href="http://en.wikipedia.org/wiki/GNU_GRUB">GRUB</a>, <a href="http://en.wikipedia.org/wiki/Chain_loading">Chain loading</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Operating_system">Operating system</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Interrupt">Interrupt</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Trap_(computing)">Trap</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Microkernel">Microkernel</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">Process Management</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li><a href="http://en.wikipedia.org/wiki/Computer_multitasking">Multitasking</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Multiprogramming">Multiprogramming</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Fork_(operating_system)">Fork</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Zombie_process">Zombie process</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Exec_(operating_system)">Exec</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Fork-exec">Fork-exec</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Interprocess_communication">Inter-process communication</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Signal_(computing)">Signal</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Remote_procedure_call">Remote procedure call</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Thread_(computer_science)">Thread</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Scheduling_(computing)">Scheduling</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Scheduling_algorithm">Scheduling algorithm</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Mutex">Mutual exclusion</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Producers-consumers_problem">Producer-consumer problem</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Preemption_(computing)">Preemption</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Critical_section">Critical section</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Busy_waiting">Busy waiting</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Spinlock">Spinlock</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Lamport's_bakery_algorithm">Bakery algorithm</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Peterson's_algorithm">Peterson's algorithm</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Lock_(computer_science)">Lock</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Test&amp;set">Test and set</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Semaphore_(programming)">Semaphore</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Deadlock">Deadlock</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Resource_starvation">Starvation</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Readers-writers_problem">Readers-writers problem</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Dining_philosophers_problem">Dining philosophers problem</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Monitor_(synchronization)">Monitor</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Banker's_algorithm">Banker's algorithm</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3">Memory Management</h4>
<div class="outline-text-4" id="text-2-3-3">

<ul>
<li><a href="http://en.wikipedia.org/wiki/Memory_management">Memory Management</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Random-access_memory">RAM</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Physical_memory">Physical memory</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Virtual_memory">Virtual memory</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Shared_library#Shared_libraries">Shared libraries</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Memory_management_unit">MMU</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Paging">Paging</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Page_fault">Page fault</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Page_table">Page table</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Memory_address">Memory address</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Thrashing_(computer_science)">Thrashing</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3-4" class="outline-4">
<h4 id="sec-2-3-4">File Management</h4>
<div class="outline-text-4" id="text-2-3-4">

<ul>
<li><a href="http://en.wikipedia.org/wiki/File_system">File system</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/File_Allocation_Table">FAT</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Inode">Inode</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/NTFS">NTFS</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Ext3">Ext3</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Comparison_of_file_systems">Comparison of file systems</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-3-5" class="outline-4">
<h4 id="sec-2-3-5">I/O Systems</h4>
<div class="outline-text-4" id="text-2-3-5">

<ul>
<li><a href="http://en.wikipedia.org/wiki/Memory-mapped_IO">Memory-mapped I/O</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">More Web Resources</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li><a href="http://www.ibm.com/developerworks/">http://www.ibm.com/developerworks/</a>
<ul>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-linuxboot/">Inside the Linux boot process</a>
</li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-system-calls/">Kernel command using Linux system calls</a>
</li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-linux-filesystem/">Anatomy of the Linux file system</a>
</li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-proc.html">Access the Linux kernel using the /proc filesystem</a>
</li>
</ul>

</li>
<li><a href="http://duartes.org/gustavo/blog/">http://duartes.org/gustavo/blog/</a>
<ul>
<li><a href="http://duartes.org/gustavo/blog/post/motherboard-chipsets-memory-map">Motherboard Chipsets and the Memory Map</a>
</li>
<li><a href="http://duartes.org/gustavo/blog/category/software-illustrated/page/2">How Computers Boot Up</a>
</li>
<li><a href="http://duartes.org/gustavo/blog/post/anatomy-of-a-program-in-memory">Anatomy of a Program in Memory</a>
</li>
<li><a href="http://duartes.org/gustavo/blog/post/how-the-kernel-manages-your-memory">How The Kernel Manages Your Memory</a>
</li>
<li><a href="http://duartes.org/gustavo/blog/post/getting-physical-with-memory">Getting Physical With Memory</a>
</li>
<li><a href="http://duartes.org/gustavo/blog/post/intel-cpu-caches">Cache: a place for concealment and safekeeping</a>
</li>
</ul>

</li>
<li><a href="http://people.redhat.com/drepper/cpumemory.pdf">What every programmer should know about memory</a>
</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2013-05-26T22:18+0800</p>

</div>
</body>
</html>
